---
kind: property
id: P:Autodesk.Revit.DB.Electrical.AreaBasedLoadType.PowerFactor
source: html/95c6a466-e821-2afb-aa44-d95f76c788b3.htm
---
# Autodesk.Revit.DB.Electrical.AreaBasedLoadType.PowerFactor Property

The power factor of area based load type.

## Syntax (C#)
```csharp
public double PowerFactor { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for power factor must be between 0 and 1.